{
"posts":[
{"id":1, "email":"somebody@gmail.com","password":"Qwerty123!"},
{"id":2, "email":"AnnaGirl@gmail.com","password":"Qwerty123!"},
{"id":3, "email":"MarkWallberg@gmail.com","password":"Qwerty123!"},
{"id":4, "email":"MarioGame@mail.ru","password":"Qwerty123!"},
{"id":5, "email":"TomCruz@gmail.com","password":"Qwerty123!"}
],
"cars":[
{"id":1,"name":"Mercedes-Benz", "logo":"https://www.carlogos.org/logo/Mercedes-Benz-logo-2011-640x369.jpg","info":"Mercedes-Benz is known for producing luxury vehicles and commercial vehicles. The headquarters is in Stuttgart, Baden-Württemberg. The name first appeared in 1926 as Daimler-Benz. In 2018, Mercedes-Benz was the largest seller of premium vehicles in the world, having sold 2.31 million passenger cars."},
{"id":2,"name":"BMW", "logo":"https://www.carlogos.org/car-logos/bmw-logo-1997-1200x1200-show.png","info":"Bayerische Motoren Werke AG, commonly referred to as BMW, is a German multinational corporation which produces luxury vehicles and motorcycles. The company was founded in 1916 as a manufacturer of aircraft engines, which it produced from 1917 until 1918 and again from 1933 to 1945."},
{"id":3,"name":"Tesla", "logo":"https://www.carlogos.org/car-logos/tesla-logo-2200x2800-show.png","info":"Tesla, Inc. is an American electric vehicle and clean energy company based in Palo Alto, California. Tesla's current products include electric cars, battery energy storage from home to grid scale, solar panels and solar roof tiles, as well as other related products and services. Tesla is ranked as the world's best-selling plug-in and battery electric passenger car manufacturer, with a market share of 16% of the plug-in segment and 23% of the battery electric segment 2020 sales."},
{"id":4,"name":"Ferrari", "logo":"https://www.carlogos.org/car-logos/ferrari-logo-750x1100-show.png","info":"Ferrari S.p.A. is an Italian luxury sports car manufacturer based in Maranello, Italy. Founded by Enzo Ferrari in 1939 out of the Alfa Romeo race division as Auto Avio Costruzioni, the company built its first car in 1940, and produced its first Ferrari-badged car in 1947."},
{"id":5,"name":"Porsche", "logo":"https://www.carlogos.org/car-logos/porsche-logo-2100x1100-show.png","info":"Porsche AG, is a German automobile manufacturer specializing in high-performance sports cars, SUVs and sedans. The headquarters of Porsche AG is in Stuttgart, and the company is owned by Volkswagen AG, a controlling stake of which is owned by Porsche Automobil Holding SE. Porsche's current lineup includes the 718 Boxster/Cayman, 911, Panamera, Macan, Cayenne and Taycan."},
{"id":6,"name":"Lamborghini", "logo":"https://www.carlogos.org/car-logos/lamborghini-logo-1000x1100-show.png","info":"Automobili Lamborghini S.p.A. is an Italian brand and manufacturer of luxury sports cars and SUVs based in Sant'Agata Bolognese. The company is owned by the Volkswagen Group through its subsidiary Audi."},
{"id":7,"name":"Ford", "logo":"https://www.carlogos.org/car-logos/ford-logo-2017-show.png","info":"The Ford Motor Company, commonly known as Ford, is an American multinational automaker that has its main headquarters in Dearborn, Michigan, a suburb of Detroit. It was founded by Henry Ford and incorporated on June 16, 1903. The company sells automobiles and commercial vehicles under the Ford brand, and most luxury cars under the Lincoln brand. Ford also owns Brazilian SUV manufacturer Troller, an 8% stake in Aston Martin of the United Kingdom and a 32% stake in Jiangling Motors."},
{"id":8,"name":"Audi", "logo":"https://www.carlogos.org/logo/Audi-logo-2009-640x334.jpg","info":"Audi AG is a German automobile manufacturer that designs, engineers, produces, markets and distributes luxury vehicles. Audi is a wholly owned subsidiary of the Volkswagen Group and has its roots at Ingolstadt, Bavaria, Germany. Audi-branded vehicles are produced in nine production facilities worldwide."}
],
"Mercedes":[
{"id":1,"type":"W222","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/2014_Mercedes-Benz_S_350_BlueTEC_%28W_222%29_sedan_%282016-01-04%29_01.jpg/420px-2014_Mercedes-Benz_S_350_BlueTEC_%28W_222%29_sedan_%282016-01-04%29_01.jpg","info":"Officially unveiled in May 2013, the newest S-Class has a more streamlined appearance than the outgoing model. Some interesting features include a large front grille inspired by the F700 Concept car and LED lights used exclusively inside and out – a first in the automotive industry. Two strong converging character lines give the flanks a more sculpted look, while integrated exhaust tips and a large glass roof (likely optional) highlight the design."},
{"id":2,"type":"G500","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Mercedes_Benz_G_2018_at_Legendy_2018_in_Prague.jpg/420px-Mercedes_Benz_G_2018_at_Legendy_2018_in_Prague.jpg","info":"The Mercedes-Benz G-Class, sometimes called G-Wagen, is a mid-size four-wheel drive luxury SUV manufactured by Magna Steyr (formerly Steyr-Daimler-Puch) in Austria and sold by Mercedes-Benz. In certain markets, it has been sold under the Puch name as Puch G."},
{"id":3,"type":"SLS","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Mercedes-Benz_SLS_AMG_%28C_197%29_%E2%80%93_Frontansicht_ge%C3%B6ffnet%2C_10._August_2011%2C_D%C3%BCsseldorf.jpg/420px-Mercedes-Benz_SLS_AMG_%28C_197%29_%E2%80%93_Frontansicht_ge%C3%B6ffnet%2C_10._August_2011%2C_D%C3%BCsseldorf.jpg","info":"The Mercedes-Benz SLS AMG (C197 / R197) is a front mid-engine, 2-seater, limited production grand tourer developed by the Mercedes-AMG division of German automotive manufacturer Mercedes-Benz, with the assistance of David Coulthard.[4] The car, which is the successor to the Mercedes-Benz SLR McLaren and was described by Mercedes-Benz as a spiritual successor to the Mercedes-Benz 300SL Gullwing, mainly because it was inspired by the latter."}
],
"Tesla":[
{"id":1,"type":"Model-S","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/2018_Tesla_Model_S_75D.jpg/420px-2018_Tesla_Model_S_75D.jpg","info":"The Tesla Model S is an all-electric five-door liftback sedan produced by Tesla, Inc., and was introduced on June 22, 2012. As of August 2020, the Model S Long Range Plus has an EPA range of 402 miles (647 km), higher than that of any other battery electric car. Model S cars built from October 2014 have a feature called Autopilot, an advanced driver assistance system that allows the car to operate without assistance from the driver. However, the driver must supervise continuously and take control if there is an issue."},
{"id":2,"type":"Roadster","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Roadster_2.5_windmills_trimmed.jpg/420px-Roadster_2.5_windmills_trimmed.jpg","info":"The Tesla Roadster is a battery electric vehicle (BEV) sports car, based on the Lotus Elise chassis, that was produced by the electric car firm Tesla Motors (now Tesla, Inc.) in California from 2008 to 2012. The Roadster was the first highway legal serial production all-electric car to use lithium-ion battery cells and the first production all-electric car to travel more than 320 kilometres (200 mi) per charge. It is also the first production car to be launched into deep space, carried by a Falcon Heavy rocket in a test flight on February 6, 2018."},
{"id":3,"type":"Cybertruck","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Tesla_Cybertruck_outside_unveil_modified_by_Smnt.jpg/420px-Tesla_Cybertruck_outside_unveil_modified_by_Smnt.jpg","info":"The Tesla Cybertruck is an all-electric, battery-powered, light duty truck announced by Tesla, Inc. Three models have been announced, with EPA range estimates of 250–500 miles (400–800 km) and an estimated 0–60 mph time of 2.9–6.5 seconds, depending on the model. The stated goal of Tesla in developing the Cybertruck is to provide a sustainable energy substitute for the roughly 6,500 fossil-fuel-powered trucks sold per day in the United States."}
],
"BMW":[
{"id":1,"type":"i8","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/2016_BMW_i8.jpg/420px-2016_BMW_i8.jpg","info":"The BMW i8 is a plug-in hybrid sports car developed by BMW. The i8 is part of BMW's electrified fleet and is marketed under the BMW i sub-brand. The production version of the BMW i8 was unveiled at the 2013 Frankfurt Motor Show, and was released in Germany in June 2014. Deliveries to retail customers in the U.S. began in August 2014. A roadster variant was launched in May 2018. Production ended in June 2020."},
{"id":2,"type":"x7","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/2019_BMW_X7_xDrive40i_in_white%2C_front_left.jpg/420px-2019_BMW_X7_xDrive40i_in_white%2C_front_left.jpg","info":"The BMW X7 is a full-sized luxury sport utility vehicle manufactured by BMW. It is BMW's flagship Sports Activity Vehicle (SAV) and the company's biggest SUV. The X7 was first announced by BMW in March 2014. It was officially unveiled on October 17, 2018, with pre-orders being taken online. The X7 has been available at dealers since March 2019."},
{"id":3,"type":"m8","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/BMW_M8_Competition_IMG_3364.jpg/420px-BMW_M8_Competition_IMG_3364.jpg","info":"The BMW M8 is the high performance version of the BMW 8 Series (G15) marketed under the BMW M sub-brand. Introduced in June 2019, the M8 was initially produced in the 2-door convertible (F91 model code) and 2-door coupe (F92 model code) body styles. A 4-door sedan (F93 model code, marketed as 'Gran Coupe') body style was added to the lineup in October 2019. The M8 is powered by the BMW S63 twin-turbocharged V8 engine shared with the BMW M5 (F90)."}
]
}
